# Задание 7
num = int(input("Введите число: "))
print("Четное" if num % 2 == 0 else "Нечетное")

# Задание 8
a = float(input("Введите первое число: "))
b = float(input("Введите второе число: "))
print(f"Наибольшее: {max(a, b)}")

# Задание 9
age = int(input("Введите ваш возраст: "))
print("Можно получить права" if age >= 18 else "Нельзя получить права")