# Задание 1
print("Hello, World!")

# Задание 2
name = input("Введите ваше имя: ")
print(f"Привет, {name}!")