# Задание 4
num1 = float(input("Введите первое число: "))
num2 = float(input("Введите второе число: "))
print(f"Сумма: {num1 + num2}")

# Задание 5
number = input("Введите число: ")
converted = int(number)
print(f"Тип данных: {type(converted)}")

# Задание 6
age = input("Введите ваш возраст: ")
print(f"Вам {age} лет.")